# Data Consistency Checks

In [359]:
# Import Libraries
import pandas as pd
import numpy as np
import os

In [360]:
# Importing Data

In [361]:
path = r'C:\Users\eminc\OneDrive\A  - Career Foundry\Data Immersion\A4 Python Fundamentals for Data Analysts\01-2023 Instacart Basket Analysis'

In [362]:
path

'C:\\Users\\Emin\\Desktop\\A  - Career Foundry\\Data Immersion\\A4 Python Fundamentals for Data Analysts\\01-2023 Instacart Basket Analysis'

In [363]:
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'products.csv'), index_col = False)

In [364]:
df_ords_1 = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_wrangled.csv'), index_col = False)

In [365]:
df_ords_1.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [366]:
# Need to delete column: "Unnamed: 0" in df_ords_1
df_ords = df_ords_1.drop(columns = ['Unnamed: 0'])

In [367]:
df_ords.describe()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [368]:
# Creating a Dataframe
df_test = pd.DataFrame()

In [369]:
# Creating a mixed type column
df_test['mix'] = ['a','b',1,True]

In [370]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [371]:
# Checking for mixed types

In [372]:
for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

In [373]:
df_test['mix'] = df_test['mix'].astype('str')

In [374]:
df_test.describe()

       mix
count    4
unique   4
top      a
freq     1

In [375]:
df_test.dtypes

mix    object
dtype: object

In [376]:
# Finding Missing Values

In [377]:
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [378]:
df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [379]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [380]:
# Addressing Missing Values

In [381]:
df_prods.shape

(49693, 5)

In [382]:
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [383]:
df_prods_clean.shape

(49677, 5)

In [384]:
# Other way to get rid of missing values

In [385]:
df_prods.dropna(subset = ['product_name'], inplace = True)

In [386]:
df_prods.shape

(49677, 5)

In [387]:
# Finding Duplicates

In [388]:
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [389]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [390]:
# Addressing Duplicates

In [391]:
df_prods_clean.shape

(49677, 5)

In [392]:
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [393]:
df_prods_clean_no_dups.shape

(49672, 5)

In [394]:
df_prods_clean_no_dups.to_csv(os.path.join(path, '02 Data','Prepared Data', 'prods_checked.csv'))

# Task: 4.5.

In [395]:
#1 Consistency check for df_prods DONE

In [396]:
#2 Check the df_ords Data

In [397]:
df_ords.describe()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [398]:
   # df_orders data seems to be okay on the overview. Orders days values are reasonable.
   # Not more than 6, considering 0 as a day so no more than 7 days.
   # the same for order_hour: not more than 24 hrs.

In [399]:
#3 Checking df_ords for mixed-type data

In [400]:
for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col)
   # this code above didn't result any indication of mixed-type data

In [401]:
df_ords.dtypes

order_id                    int64
user_id                     int64
order_number                int64
orders_day_of_week          int64
order_hour_of_day           int64
days_since_prior_order    float64
dtype: object

In [402]:
#4 Even by rechecking with describe() function, I could not find any mixed-type data. 
   #  Therefore no column to be fixed.

In [403]:
#5 Finding missing values in df_ords dataframe

In [404]:
df_ords.isnull().sum()

order_id                       0
user_id                        0
order_number                   0
orders_day_of_week             0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

In [405]:
#6 In column days_since_prior_order 206.209 missing values are identified. 
   # I guess, it was not filled in manually or was not calculated for these orders.

In [406]:
   # Now I will use mean function within replacing command .fillna(mean value, implase True).
   # Reason for using mean is, because there are no outliers in this column accoring to describe() results and
   # the average qty of days: 11 seems to me very realistic.

In [407]:
df_ords['days_since_prior_order'].fillna(df_ords['days_since_prior_order'].mean(), inplace = True)

In [408]:
df_ords.isnull().sum()

order_id                  0
user_id                   0
order_number              0
orders_day_of_week        0
order_hour_of_day         0
days_since_prior_order    0
dtype: int64

In [409]:
    # Above quantity of missing values check resulted now into 0 in all columns

In [410]:
df_ords.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,11.114836
1,2398795,1,2,3,7,15.000000
2,473747,1,3,3,12,21.000000
3,2254736,1,4,4,7,29.000000
4,431534,1,5,4,15,28.000000

In [411]:
   # above prior n.a. cell (index row 0) is now changed by the number of 11. So 11 days average filled in.

In [412]:
#7 Checking for duplicates

In [413]:
df_ords_dups = df_ords[df_ords.duplicated()]

In [414]:
df_ords_dups

Empty DataFrame
Columns: [order_id, user_id, order_number, orders_day_of_week, order_hour_of_day, days_since_prior_order]
Index: []

In [415]:
#8 No duplicates found. 
#9 Therefore I will export df_ords in latest version to "Prepared Data" Folder. df_prods already exported above.

In [ ]:
df_ords.to_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_checked.csv'))